Revit 2024 API
BuiltInFailures.DimensionFailures.DimensionOverconstrained Property
 The Dimension would overconstrain the Sketch.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static FailureDefinitionId DimensionOverconstrained { get; }
Visual Basic
Public Shared ReadOnly Property DimensionOverconstrained As FailureDefinitionId
	Get
Visual C++
public:
static property FailureDefinitionId^ DimensionOverconstrained {
	FailureDefinitionId^ get ();
}
See Also
BuiltInFailures.DimensionFailures Class
Autodesk.Revit.DB Namespace